app/controllers/massages_controller.rb

  def index
    @massages = Massage.all
---
SELECT "massages".* FROM "massages"

  def create
    @massage = Massage.new(massage_params)

    respond_to do |format|
      if @massage.save
---
INSERT INTO "massages" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ss"], ["content", "ff"], ["created_at", "2015-04-01 15:14:10.551862"], ["updated_at", "2015-04-01 15:14:10.551862"]]

    def set_massage
      @massage = Massage.find(params[:id])
---
SELECT  "massages".* FROM "massages" WHERE "massages"."id" = ? LIMIT 1  [["id", 1]]